backend/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 300  # Test for 5 minutes
      arrivalRate: 5  # Start with 5 new users per second
    - duration: 300  # Continue for another 5 minutes
      arrivalRate: 10  # Increase to 10 new users per second
    - duration: 300  # Final 5 minutes
      arrivalRate: 1  # Gradually decrease to 1 user per second
  defaults:
    headers:
      content-type: "application/json"
  http:
    timeout: 20

scenarios:
  - flow:
      - post:
          url: "/v1/login"
          json:
            username: "267767"
            password: "Jason12!"
          validate:
            - status: 200
            - json: "$.token"
          retries:
            max: 3
            on:
              - status: 429


report:
  output: "loadTestReport.json"